var mapdata=[
    {
        major: '土木工程系',
        labs: [
            {
                name: '结构工程与振动教育部重点实验室工程结构分室',
                place: '土木馆东大厅',
                loc: [116.336627,40.009906]
            },
            {
                name: '建筑材料耐久性实验室',
                place: '焊接馆303',
                loc: [116.336943,40.007182]
            },
            {
                name: '建筑材料教学实验室',
                place: '清华汽车维修部（原校西门汽修厂）',
                loc: [116.321982,40.006691]
            }
        ],
        center: [116.335866,40.009251]
    },
    {
        major: '水利水电工程系',
        labs: [
            {
                name: '水力学实验室',
                place: '旧水利馆一楼',
                loc: [116.33229,40.007522]
            }
        ],
        center: [116.33229,40.007522]
    },
    {
        major: '环境学院',
        labs: [
            {
                name: '环境分析测试中心',
                place: '环境节能楼512',
                loc: [116.341412,40.004172]
            },
            {
                name: '环境科学与工程实验实践教学中心',
                place: '环境工程实验大厅',
                loc: [116.332659,40.01008]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '机械工程系',
        labs: [
            {
                name: '摩擦学国家重点实验室（电镜实验室）',
                place: '李兆基科技大楼A510',
                loc: [116.335853,40.002578]
            },
            {
                name: '摩擦学国家重点实验室（磨损实验室）',
                place: '李兆基科技大楼AD111',
                loc: [116.335853,40.002578]
            },
            {
                name: '机械创新设计教学实验室',
                place: '李兆基科技大楼A306',
                loc: [116.335853,40.002578]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '精仪系',
        labs: [
            {
                name: '智能微系统实验室',
                place: '9003大楼4501',
                loc: [116.337993,40.003342]
            }
        ],
        center: [116.337993,40.003342]
    },
    {
        major: '能源与动力工程系',
        labs: [
            {
                name: '双腔定压燃烧实验室',
                place: '科技大楼B128',
                loc: [116.335853,40.002578]
            },
            {
                name: '分子束质谱燃烧诊断实验室',
                place: '科技大楼B120',
                loc: [116.335853,40.002578]
            },
            {
                name: '热能工程实验室',
                place: '机械工程馆',
                loc: [116.331932,40.007085]
            },
            {
                name: '超临界压力CO₂热质传递与碳封存利用实验室',
                place: '科技大楼A549-1',
                loc: [116.335853,40.002578]
            },
            {
                name: '流体机械综合试验台',
                place: '新水利馆一楼试验大厅',
                loc: [116.332152,40.009439]
            },
            {
                name: '动力工程及工程热物理实验教学中心-虚拟仿真实验室',
                place: '科技大楼A337-3',
                loc: [116.335853,40.002578]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '车辆与运载学院',
        labs: [
            {
                name: '汽车模拟驾驶实验室',
                place: '汽车研究所504',
                loc: [116.341289,40.014204]
            },
            {
                name: '燃料电池实验室',
                place: '汽车研究所502/606/607',
                loc: [116.341289,40.014204]
            },
            {
                name: '汽车专业教室',
                place: '李兆基科技大楼A113',
                loc: [116.335995,40.002584]
            },
            {
                name: '发动机喷雾燃烧光学诊断实验室',
                place: '科技大楼AD213',
                loc: [116.335995,40.002584]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '工业工程系',
        labs: [
            {
                name: '数字化能力中心实验室',
                place: '科技大楼BD222-1',
                loc: [116.335995,40.002584]
            }
        ],
        center: [116.335995,40.002584]
    },
    {
        major: '基础工业训练中心',
        labs: [
            {
                name: '电子工艺实验室',
                place: '李兆基科技大楼B450',
                loc: [116.335853,40.002578]
            },
            {
                name: '智能制造实验室',
                place: '李兆基科技大楼BD222',
                loc: [116.335853,40.002578]
            },
            {
                name: '机器人焊接实验室',
                place: '李兆基科技大楼BD139',
                loc: [116.335853,40.002578]
            },
            {
                name: '精密铸造实验室',
                place: '李兆基科技大楼BD203',
                loc: [116.335853,40.002578]
            },
            {
                name: '3D打印实验室',
                place: '李兆基科技大楼B138',
                loc: [116.335853,40.002578]
            },
            {
                name: '虚拟现实交互实验室',
                place: '李兆基科技大楼B137',
                loc: [116.335853,40.002578]
            },
            {
                name: '激光加工实验室',
                place: '李兆基科技大楼B132',
                loc: [116.335853,40.002578]
            },
            {
                name: '技创辅机器人实验室',
                place: '李兆基科技大楼BD218',
                loc: [116.335853,40.002578]
            },
            {
                name: '人工智能系统实验室',
                place: '李兆基科技大楼B232',
                loc: [116.335853,40.002578]
            },
            {
                name: '机械制造实验室',
                place: '李兆基科技大楼BD222',
                loc: [116.335853,40.002578]
            },
            {
                name: '木乐开放实验室',
                place: '李兆基科技大楼B232',
                loc: [116.335853,40.002578]
            },
            {
                name: '设计与原型工坊',
                place: '李兆基科技大楼B242',
                loc: [116.335853,40.002578]
            }
        ],
        center: [116.335853,40.002578]
    },
    {
        major: '航天航空学院',
        labs: [
            {
                name: '神经调控技术国家工程实验室',
                place: '综合科研1号楼N-204B',
                loc: [116.342624,40.011698]
            }
        ],
        center: [116.342624,40.011698]
    },
    {
        major: '信息学院电工电子实验中心',
        labs: [
            {
                name: '基本电工实验室',
                place: '西主楼4区-306等',
                loc: [116.338009,40.00724]
            },
            {
                name: '应用电工实验室',
                place: '西主楼4-区305等',
                loc: [116.338009,40.00724]
            },
            {
                name: '电子技术实验室',
                place: '西主楼3区-228等',
                loc: [116.338009,40.00724]
            },
            {
                name: 'EDA实验室',
                place: '西主楼3区-209等',
                loc: [116.338009,40.00724]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '电子工程系',
        labs: [
            {
                name: '电子工程实验教学中心',
                place: '中央主楼9层',
                loc: [116.339107,40.007595]
            },
            {
                name: '电磁实验中心微波综合暗室',
                place: '电子工程系馆B3-108',
                loc: [116.342892,40.011402]
            },
            {
                name: '纳米光电子物理及器件实验室',
                place: '电子工程系馆1-304',
                loc: [116.342892,40.011402]
            },
            {
                name: '微纳光电子学超净实验室',
                place: '电子工程系馆1-101',
                loc: [116.342892,40.011402]
            },
            {
                name: '集成光电子实验室',
                place: '电子工程系馆1-301',
                loc: [116.342892,40.011402]
            },
            {
                name: '图像识别与高速图像处理实验室',
                place: '电子工程系馆6-201',
                loc: [116.342892,40.011402]
            },
            {
                name: '多媒体信号与信息处理实验室',
                place: '电子工程系馆8-301',
                loc: [116.342892,40.011402]
            },
            {
                name: '宽带通信与信号处理实验室',
                place: '电子工程系馆8-212',
                loc: [116.342892,40.011402]
            },
            {
                name: '数据科学与智能实验室',
                place: '电子工程系馆10-202',
                loc: [116.342892,40.011402]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '计算机科学与技术系',
        labs: [
            {
                name: '计算机实验教学中心',
                place: '东主楼9区218',
                loc: [116.340094,40.00799]
            },
            {
                name: '知识工程实验室',
                place: '东主楼10区205',
                loc: [116.340094,40.00799]
            }
        ],
        center: [116.340094,40.00799]
    },
    {
        major: '自动化系',
        labs: [
            {
                name: '宽带数字媒体技术实验室',
                place: '中央主楼303',
                loc: [116.339107,40.007595]
            },
            {
                name: '计算机软件实验室',
                place: '中央主楼501',
                loc: [116.339107,40.007595]
            },
            {
                name: '虚拟与现实融合仿真实验室',
                place: '中央主楼504',
                loc: [116.339107,40.007595]
            },
            {
                name: '机器人实验室',
                place: '中央主楼508',
                loc: [116.339107,40.007595]
            },
            {
                name: '工厂自动化与网络化控制实验室',
                place: '中央主楼510',
                loc: [116.339107,40.007595]
            },
            {
                name: '智能机器人实验室',
                place: '中央主楼513',
                loc: [116.339107,40.007595]
            },
            {
                name: '过程控制实验室系统监控演示中心',
                place: '中央主楼515',
                loc: [116.339107,40.007595]
            },
            {
                name: '电力电子与运动控制实验室',
                place: '中央主楼519',
                loc: [116.339107,40.007595]
            },
            {
                name: '控制理论实验室',
                place: '中央主楼520',
                loc: [116.339107,40.007595]
            },
            {
                name: '传感器与检测实验室',
                place: '中央主楼521',
                loc: [116.339107,40.007595]
            }
        ],
        center: [116.339107,40.007595]
    },
    {
        major: '微电子所',
        labs: [
            {
                name: '清华大学微纳加工平台',
                place: '微电子所1层',
                loc: [116.337238,40.004351]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '信息化技术中心/网络研究院',
        labs: [
            {
                name: '中国下一代互联网运行演示中心',
                place: '信息科学技术大楼（FIT楼）1区101',
                loc: [116.338753,40.002437]
            },
            {
                name: '清华大学信息化核心机房',
                place: '科技大楼B区2层',
                loc: [116.335853,40.002578]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '信息技术研究院',
        labs: [
            {
                name: '数字电视技术研究中心',
                place: '信息科学技术大楼（FIT楼）1-408',
                loc: [116.338753,40.002437]
            },
            {
                name: '微处理器与片上系统技术研究中心',
                place: '信息科学技术大楼（FIT楼）4-305',
                loc: [116.338753,40.002437]
            },
            {
                name: 'WEB与软件技术研究中心',
                place: '信息科学技术大楼（FIT楼）1-310',
                loc: [116.338753,40.002437]
            },
            {
                name: '语音和语言技术研究中心',
                place: '信息科学技术大楼（FIT楼）1-302',
                loc: [116.338753,40.002437]
            },
            {
                name: '能源互联网技术研究中心',
                place: '信息科学技术大楼（FIT楼）4-307',
                loc: [116.338753,40.002437]
            },
            {
                name: '网络大数据技术研究中心',
                place: '信息科学技术大楼（FIT楼）3-429',
                loc: [116.338753,40.002437]
            },
            {
                name: '无线与移动通信技术研究中心',
                place: '信息科学技术大楼（FIT楼）4-510',
                loc: [116.338753,40.002437]
            }
        ],
        center: [116.338753,40.002437]
    },
    {
        major: '物理系',
        labs: [
            {
                name: 'LTD低温探测器实验室',
                place: '综合科研1号楼南楼608/610',
                loc: [116.342624,40.011698]
            },
            {
                name: '天文台',
                place: '天文台',
                loc: [116.325577,40.010232]
            },
            {
                name: '实验物理教学中心近代物理实验室',
                place: '第六教学楼B区8层',
                loc: [116.336688,40.008887]
            },
            {
                name: '清华-富士康纳米科技研究中心',
                place: '纳米科技楼一层展厅及一期超静间走廊',
                loc: [116.335538,40.004244]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '化学系',
        labs: [
            {
                name: '清华大学分析中心',
                place: '理科楼D区',
                loc: [116.326469,40.01098]
            },
            {
                name: '基础教学实验中心仪器分析实验室',
                place: '化学馆201',
                loc: [116.326035,40.011851]
            }
        ],
        center: [116.326469,40.01098]
    },
    {
        major: '材料学院',
        labs: [
            {
                name: '材料中心实验室电镜室（北京电子显微镜中心）',
                place: '东主楼',
                loc: [116.340249,40.007528]
            },
            {
                name: '材料中心实验室',
                place: '技术科学楼A区1层',
                loc: [116.3398,40.003893]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '电机工程与应用电子技术系',
        labs: [
            {
                name: '电磁实验中心电磁兼容实验室',
                place: '电子工程系馆B3-105',
                loc: [116.342871,40.011188]
            },
            {
                name: '电力电子与电机控制实验室',
                place: '西主楼1-101',
                loc: [116.338009,40.00724]
            },
            {
                name: '电力系统动态模拟实验室',
                place: '西主楼3区124室',
                loc: [116.338009,40.00724]
            },
            {
                name: '高电压实验室',
                place: '至善路与明德路交界处',
                loc: [116.340711,40.012494]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '工程物理系',
        labs: [
            {
                name: '低温等离子体物理实验室',
                place: '工物馆156房间',
                loc: [116.34013,40.008748]
            },
            {
                name: '等离子体科学与聚变实验室',
                place: '工物馆139房间',
                loc: [116.34013,40.008748]
            },
            {
                name: '电磁兼容实验室',
                place: '工物馆128B房间',
                loc: [116.34013,40.008748]
            },
            {
                name: '辐射防护与环境保护实验室',
                place: '工物馆231房间',
                loc: [116.34013,40.008748]
            },
            {
                name: '等离子体健康科技实验室',
                place: '工物馆201B房间',
                loc: [116.34013,40.008748]
            },
            {
                name: '公共安全实验室',
                place: '化工电大楼（工程物理系）102',
                loc: [116.342587,40.008807]
            },
            {
                name: '工程物理系新生探究实验室',
                place: '化工电大楼（工程物理系）201',
                loc: [116.342587,40.008807]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '化学工程系',
        labs: [
            {
                name: '生物催化与生物纳米技术实验室',
                place: '化工电大楼（化学工程系）604',
                loc: [116.342892,40.011402]
            },
            {
                name: '化学工程联合国家重点实验室',
                place: '工物馆276',
                loc: [116.34013,40.008748]
            },
            {
                name: '化工实验教学中心',
                place: '化学工程实验楼',
                loc: [116.341898,40.014115]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '新闻与传播学院',
        labs: [
            {
                name: '清华大学未来媒体实验室',
                place: '未来媒体实验室（原学生九食堂）',
                loc: [116.336157,40.01265]
            }
        ],
        center: [116.336157,40.01265]
    },
    {
        major: '美术学院',
        labs: [
            {
                name: '金属工艺实验室',
                place: '美术学院大楼C107',
                loc: [116.343181,40.005582]
            },
            {
                name: '陶瓷艺术与设计实验室',
                place: '美术学院大楼C111',
                loc: [116.343181,40.005582]
            },
            {
                name: '玻璃工艺实验室',
                place: '美术学院大楼C114',
                loc: [116.343181,40.005582]
            },
            {
                name: '摄影实验室',
                place: '美术学院大楼C116',
                loc: [116.343181,40.005582]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '生命科学学院',
        labs: [
            {
                name: '标本馆',
                place: '生物馆4楼',
                loc: [116.326229,40.009111]
            },
            {
                name: '蛋白质研究技术中心X射线晶体学平台',
                place: '医学科学楼B1019，1020，1021',
                loc: [116.324311,40.010679]
            },
            {
                name: '蛋白质研究技术中心蛋白质制备与鉴定平台',
                place: '医学科学楼E204，211',
                loc: [116.324311,40.010679]
            },
            {
                name: '蛋白质研究技术中心核磁技术平台',
                place: '医学科学楼B1012',
                loc: [116.324311,40.010679]
            },
            {
                name: '蛋白质研究技术中心功能分析平台',
                place: '医学科学楼E233',
                loc: [116.324311,40.010679]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '医研院',
        labs: [
            {
                name: '生物医学测试中心共享仪器平台(生物技术馆)',
                place: '生物技术馆2104/2102/1102',
                loc: [116.323079,40.010688]
            },
            {
                name: '生物医学测试中心共享仪器平台(医学科学楼)',
                place: '医学科学楼B1008/B1009',
                loc: [116.324311,40.010679]
            },
            {
                name: '生物医学测试中心细胞生物平台',
                place: '医学科学楼C117、C119',
                loc: [116.324311,40.010679]
            },
            {
                name: '生物医学测试中心蛋白质化学和蛋白质组学平台',
                place: '医学科学楼B1014',
                loc: [116.324311,40.010679]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '核研院',
        labs: [
            {
                name: '新材料研究室',
                place: '核研院昌平试验基地（200号）元件楼',
            },
            {
                name: '北京市核检测技术重点实验室',
                place: '核研院昌平试验基地（200号）102楼',
            },
            {
                name: '清华大学中美生物燃料联合研究中心、北京市生物燃料工程技术研究中心',
                place: '核研院昌平试验基地（200号）工程楼二楼',
            },
            {
                name: '生物燃料技术创新与应用北京市国际科技合作基地',
                place: '核研院昌平试验基地（200号）工程楼二楼',
            }
        ],
        center: [116.33192,40.012722]
    }
];
