var a='hello';

var mapdata=[
    {
        major: '土木工程系',
        labs: [
            {
                name: '工程结构实验室',
                place: '土木系实验室',
                leader: '王宗纲',
                phone: '83700，13911193233',
                loc: [116.335866,40.009251]
            },
            {
                name: '建筑材料实验室',
                place: '土木系实验室',
                leader: '韩建国',
                phone: '97764，18010182935',
                loc: [116.335866,40.009251]
            }
        ],
        center: [116.335866,40.009251]
    },
    {
        major: '水利水电工程系',
        labs: [
            {
                name: '水力学实验室',
                place: '旧水利馆2层203',
                leader: '郑双凌',
                phone: '89454',
                loc: [116.33229,40.007522]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '环境工程系',
        labs: [
            {
                name: '环境公共研究平台',
                place: '环境节能楼5层',
                leader: '邱勇',
                phone: '96953',
                loc: [116.341412,40.004172]
            },
            {
                name: '环境科学与工程实验教学中心',
                place: '环境工程实验楼',
                leader: '杨宏伟',
                phone: '72987-610',
                loc: [116.332686,40.010342]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '机械工程系',
        labs: [
            {
                name: '摩擦学国家重点实验室（电镜实验室）',
                place: '李兆基A510',
                leader: '王榕',
                phone: '62772522',
                loc: [116.335853,40.002578]
            },
            {
                name: '摩擦学国家重点实验室（磨损实验室）',
                place: '李兆基AD111',
                leader: '秦力',
                phone: '62781379',
                loc: [116.335853,40.002578]
            },
            {
                name: '机械创新设计教学实验室',
                place: 'A306-308',
                leader: '沈强',
                phone: '6279512',
                loc: [116.335853,40.002578]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '能源与动力工程系',
        labs: [
            {
                name: '燃料电池实验室',
                place: '李兆基科技大楼A649',
                leader: '贾川 李小连',
                phone: '18811362107',
                loc: [116.335853,40.002578]
            },
            {
                name: '激光诱导击穿光谱实验室',
                place: '李兆基科技大楼A682-3',
                leader: '侯宗余',
                phone: '13581803153',
                loc: [116.335853,40.002578]
            },
            {
                name: '磁悬浮旋转机械实验室',
                place: '李兆基科技大楼BD127',
                leader: '马彦会',
                phone: '18813000513',
                loc: [116.335853,40.002578]
            },
            {
                name: '流体机械实验室',
                place: '新水利馆一楼东侧',
                leader: '罗永要',
                phone: '13691550105',
                loc: [116.332152,40.009439]
            },
            {
                name: '热能工程实验室',
                place: '能动系系馆（二校门旁）',
                leader: '张扬',
                phone: '13581891840',
                loc: [116.331888,40.006878]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '汽车工程系',
        labs: [
            {
                name: '汽车碰撞实验室',
                place: '汽车碰撞实验室',
                leader: '马令晨',
                phone: '88689',
                loc: [116.341289,40.014204]
            },
            {
                name: '汽车模拟驾驶实验室',
                place: '汽车研究所504',
                leader: '王文军',
                phone: '86082',
                loc: [116.341289,40.014204]
            },
            {
                name: '燃料电池实验室',
                place: '汽车研究所502',
                leader: '黄海燕',
                phone: '94522',
                loc: [116.341289,40.014204]
            },
            {
                name: '发动机实验室',
                place: '汽车研究所606',
                leader: '黄海燕',
                phone: '94522',
                loc: [116.341289,40.014204]
            },
            {
                name: '汽车转鼓试验台',
                place: '汽车研究所503',
                leader: '肖建华',
                phone: '93359',
                loc: [116.341289,40.014204]
            },
            {
                name: '汽车结构实验室',
                place: '科技大楼A113',
                leader: '黄锦川',
                phone: '73436',
                loc: [116.335995,40.002584]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '工业工程系',
        labs: [
            {
                name: '数字化制造实验室',
                place: '科技大楼BD222',
                leader: '王晓芳',
                phone: '81119',
                loc: [116.335995,40.002584]
            },
            {
                name: '物流工程实验室',
                place: '经管西楼南521A',
                leader: '严京滨',
                phone: '93170',
                loc: [116.337825,40.00508]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '电机工程与应用电子技术系',
        labs: [
            {
                name: '电力电子与电机控制实验室',
                place: '西主楼1-101',
                leader: '毕大强',
                phone: '62797633 13520913302',
                loc: [116.338009,40.00724]
            },
            {
                name: '高电压实验室',
                place: '至善路与明德路交界处',
                leader: '高胜友',
                phone: '62794807',
                loc: [116.340711,40.012494]
            },
            {
                name: '电力系统动态模拟实验室',
                place: '西主楼3区124室',
                leader: '王彬',
                phone: '13811551890',
                loc: [116.338009,40.00724]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '电子工程系',
        labs: [
            {
                name: '电子工程教学中心实验室',
                place: '中央主楼9层',
                leader: '马晓红',
                phone: '72910',
                loc: [116.339107,40.007595]
            },
            {
                name: '电磁实验中心微波综合暗室',
                place: '罗姆楼B3-108',
                leader: '杨帆, 熊林',
                phone: '18310737922',
                loc: [116.342892,40.011402]
            },
            {
                name: '集成光电子实验室',
                place: '罗姆楼1-301',
                leader: '韩彦军',
                phone: '98300',
                loc: [116.342892,40.011402]
            },
            {
                name: '微纳光电子学超净实验室',
                place: '罗姆楼1-101',
                leader: '崔开宇',
                phone: '15210202760',
                loc: [116.342892,40.011402]
            },
            {
                name: '媒体大数据认知计算研究中心',
                place: '罗姆楼1层大厅',
                leader: '王生进, 徐曼',
                phone: '73710',
                loc: [116.342892,40.011402]
            },
            {
                name: '图像识别与高速图像处理实验室',
                place: '罗姆楼6-201',
                leader: '苏光大',
                phone: '81439',
                loc: [116.342892,40.011402]
            },
            {
                name: '三维图像认知实验室',
                place: '罗姆楼713',
                leader: '马惠敏, 潘泽宇',
                phone: '81432 17614483935',
                loc: [116.342892,40.011402]
            },
            {
                name: '儿童认知实验室（与外文系联合实验室）',
                place: '罗姆楼713',
                leader: '周鹏, 马惠敏',
                phone: '15858263432 81432',
                loc: [116.342892,40.011402]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '计算机科学与技术系',
        labs: [
            {
                name: '公共平台国家实验室',
                place: '信息科学技术大楼（FIT楼） 2D04',
                leader: '林  皎、柳  嘉',
                phone: '62798981 62796945',
                loc: [116.338753,40.002437]
            },
            {
                name: '计算机实验教学中心',
                place: '东主楼9区218',
                leader: '陈永强',
                phone: '72213',
                loc: [116.340094,40.00799]
            },
            {
                name: '增强现实交互式教学技术实验室',
                place: 'FIT楼3-526',
                leader: '陶品',
                phone: '13717813059',
                loc: [116.338753,40.002437]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '自动化系',
        labs: [
            {
                name: '计算机软件实验室',
                place: '中央主楼501',
                leader: '杨建华',
                phone: '82611-1501',
                loc: [116.339107,40.007595]
            },
            {
                name: '虚拟与现实融合仿真实验室',
                place: '中央主楼504',
                leader: '杨建华',
                phone: '82611-1501',
                loc: [116.339107,40.007595]
            },
            {
                name: '机器人实验室',
                place: '中央主楼508',
                leader: '于永超',
                phone: '94322',
                loc: [116.339107,40.007595]
            },
            {
                name: '工厂自动化与网络化控制实验室',
                place: '中央主楼510',
                leader: '马喜春',
                phone: '82611-1510',
                loc: [116.339107,40.007595]
            },
            {
                name: '无人机实验室',
                place: '中央主楼514',
                leader: '邓瑞亮',
                phone: '82270',
                loc: [116.339107,40.007595]
            },
            {
                name: '过程控制实验室系统监控演示中心',
                place: '中央主楼515',
                leader: '吕文祥',
                phone: '82611-1515',
                loc: [116.339107,40.007595]
            },
            {
                name: '电力电子与运动控制实验室',
                place: '中央主楼519',
                leader: '薛文轩 王春凤',
                phone: '82611-1504 94002',
                loc: [116.339107,40.007595]
            },
            {
                name: '控制理论实验室',
                place: '中央主楼520',
                leader: '赵世敏',
                phone: '94313-1520',
                loc: [116.339107,40.007595]
            },
            {
                name: '传感器与检测实验室',
                place: '中央主楼521',
                leader: '陆耿',
                phone: '82270',
                loc: [116.339107,40.007595]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '航空航天学院',
        labs: [
            {
                name: '材料力学教学实验室',
                place: '逸夫技术科学楼3104',
                leader: '徐曼琼 于兴哲',
                phone: '13426163721 15810211549',
                loc: [116.3398,40.003893]
            },
            {
                name: '智能空间系统联合研究中心',
                place: '蒙民伟科技大楼N-102',
                leader: '李晓琨',
                phone: '18911498908',
                loc: [116.342624,40.011698]
            },
            {
                name: '神经调控技术国家工程实验室',
                place: '蒙民伟科技大楼N-204B',
                leader: '李路明 胡春华',
                phone: '62796172',
                loc: [116.342624,40.011698]
            },
            {
                name: '分布式航天器系统实验室',
                place: '蒙民伟科技大楼N-B102',
                leader: '王兆魁',
                phone: '62794316',
                loc: [116.342624,40.011698]
            },
            {
                name: '喷雾燃烧与推进实验室',
                place: '航院综合实验基地东区实验室（106实验室院内）',
                leader: '王兵',
                phone: '62782154',
                loc: [116.342624,40.011698]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '工程物理系',
        labs: [
            {
                name: '低温等离子体物理实验室',
                place: '工物馆156房间',
                leader: '蒲以康',
                phone: '62773931',
                loc: [116.34013,40.008748]
            },
            {
                name: '聚变与等离子体科学实验室',
                place: '工物馆139房间',
                leader: '谭  熠',
                phone: '62791874',
                loc: [116.34013,40.008748]
            },
            {
                name: '核电子学教学实验室',
                place: '工物馆228房间',
                leader: '倪建平',
                phone: '62771962',
                loc: [116.34013,40.008748]
            },
            {
                name: '电磁兼容实验室',
                place: '工物馆128B房间',
                leader: '孟  萃',
                phone: '62771962',
                loc: [116.34013,40.008748]
            },
            {
                name: '核数据获取与处理实验室',
                place: '工物馆217房间',
                leader: '肖永顺',
                phone: '62785142',
                loc: [116.34013,40.008748]
            },
            {
                name: '辐射防护与环境保护实验室',
                place: '工物馆231房间',
                leader: '曾  志',
                phone: '62796715',
                loc: [116.34013,40.008748]
            },
            {
                name: '等离子体健康科技实验室',
                place: '工物馆201B房间',
                leader: '李和平',
                phone: '62782816',
                loc: [116.34013,40.008748]
            },
            {
                name: '公共安全实验室',
                place: '刘卿楼102房间',
                leader: '申世飞',
                phone: '62792857',
                loc: [116.342562,40.009121]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '化学工程系',
        labs: [
            {
                name: '生物催化与生物纳米技术实验室',
                place: '化工电大楼604',
                leader: '梁有向',
                phone: '96463',
                loc: [116.342587,40.008807]
            },
            {
                name: '国家重点实验室',
                place: '工物馆276',
                leader: '于艳梅',
                phone: '84540',
                loc: [116.34013,40.008748]
            },
            {
                name: '化工实验教学中心',
                place: '化学工程实验楼',
                leader: '彭勇',
                phone: '85504-11',
                loc: [116.341898,40.014115]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '材料学院',
        labs: [
            {
                name: '新型陶瓷与精细工艺国家重点实验室',
                place: '技术科学楼2区1、2楼',
                leader: '胡晓青',
                phone: '92520',
                loc: [116.3398,40.003893]
            },
            {
                name: '北京电子显微镜室',
                place: '主楼11区1楼西',
                leader: '闫允杰',
                phone: '73996',
                loc: [116.339107,40.007595]
            },
            {
                name: '材料科学与工程研究院中心实验室',
                place: '技术科学楼1区1层',
                leader: '苗伟',
                phone: '84581',
                loc: [116.3398,40.003893]
            },
            {
                name: '纳米稀土材料室',
                place: '技术科学楼2区2303',
                leader: '吴晓东',
                phone: '92375',
                loc: [116.3398,40.003893]
            },
            {
                name: '材料加工技术实验室',
                place: '技术科学楼3区3215',
                leader: '朱宏伟',
                phone: '81065',
                loc: [116.3398,40.003893]
            },
            {
                name: '材料加工虚拟现实实验室',
                place: '科技大楼A213',
                leader: '康进武',
                phone: '84537',
                loc: [116.3398,40.003893]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '物理系',
        labs: [
            {
                name: '物理系天文台',
                place: '天文台',
                leader: '王允冲',
                phone: '13681251499',
                loc: [116.325577,40.010232]
            },
            {
                name: '清华-富士康纳米科技研究中心',
                place: '纳米楼',
                leader: '练晓杰',
                phone: '62772881',
                loc: [116.335538,40.004244]
            },
            {
                name: '物理系冷原子实验室',
                place: '理科楼C111',
                leader: '邹奕权  刘奇',
                phone: '15210591876  15201202017',
                loc: [116.335538,40.004244]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '化学系',
        labs: [
            {
                name: '分析中心实验室',
                place: '理科楼4区1、3层',
                leader: '杨海军',
                phone: '88971',
                loc: [116.335538,40.004244]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '清华大学生命科学学院',
        labs: [
            {
                name: '标本馆',
                place: '生物旧馆4楼',
                leader: '王菁兰',
                phone: '62772254',
                loc: [116.326229,40.009111]
            },
            {
                name: '现代生命科学实验教学中心',
                place: '生物馆',
                leader: '张贵友',
                phone: '',
                loc: [116.326229,40.009111]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '生命科学学院蛋白质研究技术中心',
        labs: [
            {
                name: '细胞影像平台',
                place: '郑裕彤医学楼E225',
                leader: '张彦丽',
                phone: '62772736',
                loc: [116.324278,40.010539]
            },
            {
                name: 'X射线晶体学平台',
                place: '医学科学楼B1019，1020，1021',
                leader: '范仕龙',
                phone: '62792931',
                loc: [116.324311,40.010679]
            },
            {
                name: '蛋白质制备与鉴定平台',
                place: '郑裕彤医学楼E204 ，211',
                leader: '褚文丹',
                phone: '62772174',
                loc: [116.324278,40.010539]
            },
            {
                name: '核磁技术平台',
                place: '医学科学楼B1012',
                leader: '徐宁',
                phone: '62786202',
                loc: [116.324311,40.010679]
            },
            {
                name: '细胞冷冻电镜平台',
                place: '郑裕彤医学楼E220-1',
                leader: '李英',
                phone: '62771601',
                loc: [116.324278,40.010539]
            },
            {
                name: '功能分析平台',
                place: '郑裕彤医学楼E233',
                leader: '刘言',
                phone: '62773195',
                loc: [116.324278,40.010539]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '生命科学学院生物医学测试中心',
        labs: [
            {
                name: '共享仪器平台',
                place: '生物技术馆2104 2102 1102',
                leader: '李海冬 刘亚飞',
                phone: '62798144',
                loc: [116.322956,40.010751]
            },
            {
                name: '细胞生物平台',
                place: '医学楼C117、C119',
                leader: '王亚林',
                phone: '62781860',
                loc: [116.324278,40.010539]
            },
            {
                name: '蛋白质化学和蛋白质组学平台',
                place: '医学科学楼B1014',
                leader: '孟宪斌',
                phone: '62789415-211',
                loc: [116.324311,40.010679]
            },
            {
                name: '尼康影像中心',
                place: '医学楼C153',
                leader: '王瑾瑜',
                phone: '62798727',
                loc: [116.324278,40.010539]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '法学院',
        labs: [
            {
                name: '模拟法庭实验室',
                place: '法学院明理楼216',
                leader: '官海彪',
                phone: '83823',
                loc: [116.338539,40.004194]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '新闻与传播学院',
        labs: [
            {
                name: '新闻与传播学实验教学中心',
                place: '文西楼（旧电机馆）',
                leader: '王庆柱',
                phone: '72388',
                loc: [116.3327,40.008732]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '美术学院',
        labs: [
            {
                name: '金属工艺实验室',
                place: '美院C107',
                leader: '王玉峰',
                phone: '13581830908',
                loc: [116.343181,40.005582]
            },
            {
                name: '陶瓷艺术与设计实验室',
                place: '美院Ｃ111',
                leader: '王萌',
                phone: '18501997120',
                loc: [116.343181,40.005582]
            },
            {
                name: '玻璃工艺实验室',
                place: '美院Ｃ114',
                leader: '马小生',
                phone: '18610059907',
                loc: [116.343181,40.005582]
            },
            {
                name: '摄影实验室',
                place: '美院C116',
                leader: '刘祺',
                phone: '18500138624',
                loc: [116.343181,40.005582]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '微电子所',
        labs: [
            {
                name: '清华大学微纳加工平台',
                place: '微电子所1层',
                leader: '伍晓明',
                phone: '6281090',
                loc: [116.337238,40.004351]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '基础工业训练中心',
        labs: [
            {
                name: '电子工艺实验室',
                place: '李兆基科技大楼B450',
                leader: '韦思健',
                phone: '62785776',
                loc: [116.33192,40.012722]
            },
            {
                name: '数字制造实验室',
                place: '李兆基科技大楼BD222',
                leader: '左晶',
                phone: '18610158484',
                loc: [116.335853,40.002578]
            },
            {
                name: '碳立方实验室',
                place: '李兆基科技大楼BD128',
                leader: '张琦',
                phone: '18310488994',
                loc: [116.335853,40.002578]
            },
            {
                name: '机器人焊接实验室',
                place: '李兆基科技大楼BD139',
                leader: '高党寻',
                phone: '18710220329',
                loc: [116.335853,40.002578]
            },
            {
                name: '精密铸造实验室',
                place: '李兆基科技大楼BD203',
                leader: '马运',
                phone: '13581950265',
                loc: [116.335853,40.002578]
            },
            {
                name: '3D打印实验室',
                place: '李兆基科技大楼B138',
                leader: '张秀海',
                phone: '13661321220',
                loc: [116.335853,40.002578]
            },
            {
                name: '虚拟现实交互实验室',
                place: '李兆基科技大楼B137',
                leader: '王德宇',
                phone: '62797448',
                loc: [116.335853,40.002578]
            },
            {
                name: '激光加工实验室',
                place: '李兆基科技大楼B132',
                leader: '高炬',
                phone: '62788520-801',
                loc: [116.335853,40.002578]
            },
            {
                name: '机器人实验室',
                place: '李兆基科技大楼BD218',
                leader: '陈凯',
                phone: '62797448',
                loc: [116.335853,40.002578]
            },
            {
                name: '智能交通实验室',
                place: '李兆基科技大楼B232',
                leader: '王德宇',
                phone: '62797448',
                loc: [116.335853,40.002578]
            },
            {
                name: '车削实验室',
                place: '李兆基科技大楼BD202',
                leader: '梁迎春',
                phone: '62773220',
                loc: [116.335853,40.002578]
            },
            {
                name: '铣削实验室',
                place: '李兆基科技大楼BD222',
                leader: '李睿',
                phone: '62771688',
                loc: [116.335853,40.002578]
            },
            {
                name: '钳木实验室',
                place: '李兆基科技大楼B242',
                leader: '张新',
                phone: '62782418',
                loc: [116.335853,40.002578]
            },
            {
                name: '科研加工服务间',
                place: '李兆基科技大楼BD221',
                leader: '王秋红',
                phone: '62771688',
                loc: [116.335853,40.002578]
            },
            {
                name: '智能系统实验室',
                place: '李兆基科技大楼B342',
                leader: '陈震',
                phone: '13811550483',
                loc: [116.335853,40.002578]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '信息学院院/电工电子实验中心',
        labs: [
            {
                name: '基本电工实验室',
                place: '西主楼4区-306等',
                leader: '张丕进',
                phone: '62794465',
                loc: [116.33192,40.012722]
            },
            {
                name: '应用电工实验室',
                place: '西主楼4-区305等',
                leader: '段玉生',
                phone: '62794466',
                loc: [116.338009,40.00724]
            },
            {
                name: '电子技术实验室',
                place: '西主楼3区-228等',
                leader: '任艳频',
                phone: '62773765',
                loc: [116.338009,40.00724]
            },
            {
                name: 'EDA实验室',
                place: '西主楼3区-209等',
                leader: '秦俭',
                phone: '62773765',
                loc: [116.338009,40.00724]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '信息技术中心',
        labs: [
            {
                name: '中国下一代互联网运行演示中心',
                place: '信息科学技术大楼（Fit楼）1区101',
                leader: '李  翀',
                phone: '62603013',
                loc: [116.338753,40.002437]
            },
            {
                name: '纪念中国教育和科研计算机网CERNET建设二十周年成果展',
                place: '信息科学技术大楼（Fit楼）2区D08',
                leader: '李  翀',
                phone: '62603013',
                loc: [116.338753,40.002437]
            },
            {
                name: '清华大学信息化核心机房',
                place: '李兆基科技大楼B区2层',
                leader: '',
                phone: '',
                loc: [116.335853,40.002578]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '软件学院',
        labs: [
            {
                name: '软件实验室',
                place: '东主楼10-316',
                leader: '白双伟',
                phone: '62795397',
                loc: [116.340249,40.007528]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '医学院生物医学工程系',
        labs: [
            {
                name: '生物医学工程教学实验室',
                place: '医学科学楼B221，B224',
                leader: '丁辉 梁作清',
                phone: '62796224 13911716159',
                loc: [116.324311,40.010679]
            }
        ],
        center: [116.33192,40.012722]
    },
    {
        major: '信息技术研究院',
        labs: [
            {
                name: '无线与移动通信技术研究中心',
                place: 'FIT楼4-510',
                leader: '赵明',
                phone: '',
                loc: [116.338753,40.002437]
            },
            {
                name: '数字电视技术研究中心',
                place: 'FIT楼1-409',
                leader: '薛永林',
                phone: '',
                loc: [116.338753,40.002437]
            },
            {
                name: '微处理器与片上系统技术研究中心',
                place: 'FIT楼4-305',
                leader: '薛一波',
                phone: '',
                loc: [116.338753,40.002437]
            },
            {
                name: 'WEB与软件技术研究中心',
                place: 'FIT楼1-310',
                leader: '张勇',
                phone: '',
                loc: [116.338753,40.002437]
            },
            {
                name: '语音和语言技术研究中心',
                place: 'FIT楼1-302',
                leader: '王东',
                phone: '',
                loc: [116.338753,40.002437]
            },
            {
                name: '能源互联网技术研究中心',
                place: 'FIT楼4-307',
                leader: '曹军威',
                phone: '',
                loc: [116.338753,40.002437]
            },
            {
                name: '网络大数据技术研究中心',
                place: 'FIT楼3-429',
                leader: '尹浩',
                phone: '',
                loc: [116.338753,40.002437]
            },
            {
                name: '轨道交通技术研究中心',
                place: 'FIT楼1-306',
                leader: '董炜',
                phone: '89454',
                loc: [116.338753,40.002437]
            }
        ],
        center: [116.33192,40.012722]
    }
];

alert('this is data.js');
